In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
pd.Series((1,2,3,4,5))

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
pd.Series(['India','Australia','USA','U.K','Signapore'])

0        India
1    Australia
2          USA
3          U.K
4    Signapore
dtype: object

In [8]:
pd.Series(('India','Australia','USA','U.K','Signapore'))

0        India
1    Australia
2          USA
3          U.K
4    Signapore
dtype: object

In [9]:
countries = ['India','Australia','USA','U.K','Signapore']
population = [140,10,33,15,4]
arr = np.array(population)
print(arr)
dict = {'A':10,'B':20,'C':30,'D':40,'E':50,'A':60,'F':60,'G':70,'H':80}

[140  10  33  15   4]

In [10]:
pd.Series(countries)

0        India
1    Australia
2          USA
3          U.K
4    Signapore
dtype: object

In [11]:
pd.Series(population)

0    140
1     10
2     33
3     15
4      4
dtype: int64

In [13]:
pd.Series(population, index=countries)

India        140
Australia     10
USA           33
U.K           15
Signapore      4
dtype: int64

In [14]:
pd.Series(arr)

0    140
1     10
2     33
3     15
4      4
dtype: int32

In [15]:
pd.Series(arr,index=countries)

India        140
Australia     10
USA           33
U.K           15
Signapore      4
dtype: int32

In [16]:
s = pd.Series(dict)

In [17]:
s

A    60
B    20
C    30
D    40
E    50
F    60
G    70
H    80
dtype: int64

In [19]:
s['A']

60

In [20]:
s['A':'D']

A    60
B    20
C    30
D    40
dtype: int64

In [23]:
s[2:5]

C    30
D    40
E    50
dtype: int64

In [24]:
s + s

A    120
B     40
C     60
D     80
E    100
F    120
G    140
H    160
dtype: int64

In [25]:
s / 2

A    30.0
B    10.0
C    15.0
D    20.0
E    25.0
F    30.0
G    35.0
H    40.0
dtype: float64

In [26]:
s * 2

A    120
B     40
C     60
D     80
E    100
F    120
G    140
H    160
dtype: int64

In [27]:
s ** 2

A    3600
B     400
C     900
D    1600
E    2500
F    3600
G    4900
H    6400
dtype: int64

In [28]:
s1 = pd.Series({'A':10,'B':20,'C':30,'D':40,'E':50,'F':60,'H':80,})
s1

A    10
B    20
C    30
D    40
E    50
F    60
H    80
dtype: int64

In [29]:
s + s1

A     70.0
B     40.0
C     60.0
D     80.0
E    100.0
F    120.0
G      NaN
H    160.0
dtype: float64

In [32]:
dict1 = pd.Series({1:10,2:20,3:30,4:40})  # Here dictionary use the keys as index and dont use the default indexing, 
dict1

1    10
2    20
3    30
4    40
dtype: int64

In [31]:
dict1[1]

10

In [33]:
dict1[0:3]

1    10
2    20
3    30
dtype: int64

In [35]:
df = pd.DataFrame()
print(df)
type(df)

Empty DataFrame
Columns: []
Index: []

pandas.core.frame.DataFrame

In [36]:
fruits = ['Apple','Banana','Orange','Grapes']
fruits_df = pd.DataFrame(fruits)
fruits_df

        0
0   Apple
1  Banana
2  Orange
3  Grapes

In [38]:
fruits = ['Apple','Banana','Orange','Grapes']
fruits_df = pd.DataFrame(fruits, columns=['Fruits'])
fruits_df

   Fruits
0   Apple
1  Banana
2  Orange
3  Grapes

In [39]:
people = [['Rocky',60,'A+'],['Raj',50,'B+'],['Sam',45,'B-'],['Vijay',42,'O+']]
people_df = pd.DataFrame(people, columns = ['Name','Age','Blood Group'])
people_df

    Name  Age Blood Group
0  Rocky   60          A+
1    Raj   50          B+
2    Sam   45          B-
3  Vijay   42          O+

In [40]:
people1 = {'Name':['Rocky','Raj','Sam','Vijay'],'Age':[60,50,45,41],'Blood Group':['A+','B+','B-','O+']}
people1_df = pd.DataFrame(people1)
people1_df

    Name  Age Blood Group
0  Rocky   60          A+
1    Raj   50          B+
2    Sam   45          B-
3  Vijay   41          O+

In [41]:
# What happen if we use different column name as user defined column names
people2 = {'Name':['Rocky','Raj','Sam','Vijay'],'Age':[60,50,45,41],'Blood Group':['A+','B+','B-','O+']}
people2_df = pd.DataFrame(people2, columns=['Name','Age','BG'])
people2_df

    Name  Age   BG
0  Rocky   60  NaN
1    Raj   50  NaN
2    Sam   45  NaN
3  Vijay   41  NaN

In [42]:
# How to access a particular column
people1_df['Name']

0    Rocky
1      Raj
2      Sam
3    Vijay
Name: Name, dtype: object

In [43]:
people1_df['Age']

0    60
1    50
2    45
3    41
Name: Age, dtype: int64

In [44]:
people1_df['Blood Group']

0    A+
1    B+
2    B-
3    O+
Name: Blood Group, dtype: object

In [45]:
people1_df[['Name','Age']]

    Name  Age
0  Rocky   60
1    Raj   50
2    Sam   45
3  Vijay   41

In [49]:
# create dataframe by reading csv file available over net
df_csv = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.csv')
df_csv

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [50]:
# Check no. of rows and columns
df_csv.shape

(6, 7)

In [51]:
# metadata(data about data)
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         6 non-null      int64
 1   Address    6 non-null      object
 2   City       6 non-null      object
 3   State      6 non-null      object
 4   Country    6 non-null      object
 5   Name       6 non-null      object
 6   Employees  6 non-null      int64
dtypes: int64(2), object(5)
memory usage: 464.0+ bytes

In [52]:
df_csv.head()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [53]:
df_csv.tail()

,ID,Address,City,State,Country,Name,Employees
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [54]:
df_csv.dtypes

ID            int64
Address      object
City         object
State        object
Country      object
Name         object
Employees     int64
dtype: object

In [55]:
df_csv.size

42

In [57]:
df_csv.count()

ID           6
Address      6
City         6
State        6
Country      6
Name         6
Employees    6
dtype: int64

In [58]:
df_csv.index

RangeIndex(start=0, stop=6, step=1)

In [64]:
# Access mutliple columns as list []
df_csv[['ID','Address','City']]

   ID          Address           City
0   1     3666 21st St  San Francisco
1   2   735 Dolores St  San Francisco
2   3      332 Hill St  San Francisco
3   4     3995 23rd St  San Francisco
4   5  1056 Sanchez St  San Francisco
5   6  551 Alvarado St  San Francisco

In [66]:
df_csv[['ID','Address','City']]

   ID          Address           City
0   1     3666 21st St  San Francisco
1   2   735 Dolores St  San Francisco
2   3      332 Hill St  San Francisco
3   4     3995 23rd St  San Francisco
4   5  1056 Sanchez St  San Francisco
5   6  551 Alvarado St  San Francisco

In [67]:
# Index change is happening only in display results, not in actual df
df_csv.set_index('ID')

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [68]:
df_csv

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [74]:
df1 = df_csv.set_index('ID')
df1

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [76]:
df_csv.set_index('ID',inplace=True)

In [77]:
df_csv

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [75]:
df1.reset_index()

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [78]:
df1

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [82]:
df_csv.reset_index(inplace=True)

In [83]:
df_csv

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [84]:
df_csv.shape

(6, 7)

In [85]:
df1.shape

(6, 6)

In [86]:
df1

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [87]:
df1[1:4]   # works on default indexing

,Address,City,State,Country,Name,Employees
ID,,,,,,
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [90]:
df1.iloc[1:4]

,Address,City,State,Country,Name,Employees
ID,,,,,,
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [88]:
df1[:4]

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [89]:
df1.loc[1:4]   .loc works on userdefined index

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [91]:
# Creation of df through json data
df_json = pd.read_json('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets.json')
df_json

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [93]:
df_excel = pd.read_excel('https://github.com/insaid2018/Term-1/blob/master/Data/Casestudy/supermarkets.xlsx?raw=true')
df_excel

,ID,Address,City,State,Country,Supermarket Name,Number of Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [94]:
df_txt = pd.read_csv('https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Casestudy/supermarkets-semi-colons.txt', sep = ';')
df_txt

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [97]:
car_sales= pd.read_csv("https://raw.githubusercontent.com/insaid2018/Term-1/master/Data/Projects/car_sales.csv", encoding='cp1252')
car_sales

,car,price,body,mileage,engV,engType,registration,year,model,drive
0,Ford,15500.0,crossover,68,2.5,Gas,yes,2010,Kuga,full
1,Mercedes-Benz,20500.0,sedan,173,1.8,Gas,yes,2011,E-Class,rear
2,Mercedes-Benz,35000.0,other,135,5.5,Petrol,yes,2008,CL 550,rear
3,Mercedes-Benz,17800.0,van,162,1.8,Diesel,yes,2012,B 180,front
4,Mercedes-Benz,33000.0,vagon,91,NaN,Other,yes,2013,E-Class,NaN
...,...,...,...,...,...,...,...,...,...,...
9571,Hyundai,14500.0,crossover,140,2.0,Gas,yes,2011,Tucson,front
9572,Volkswagen,2200.0,vagon,150,1.6,Petrol,yes,1986,Passat B2,front
9573,Mercedes-Benz,18500.0,crossover,180,3.5,Petrol,yes,2008,ML 350,full
9574,Lexus,16999.0,sedan,150,3.5,Gas,yes,2008,ES 350,front
9575,Audi,22500.0,other,71,3.6,Petrol,yes,2007,Q7,full

In [100]:
car_sales.shape

(9576, 10)

In [98]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9576 entries, 0 to 9575
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   car           9576 non-null   object
 1   price         9576 non-null   float64
 2   body          9576 non-null   object
 3   mileage       9576 non-null   int64
 4   engV          9142 non-null   float64
 5   engType       9576 non-null   object
 6   registration  9576 non-null   object
 7   year          9576 non-null   int64
 8   model         9576 non-null   object
 9   drive         9065 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 748.2+ KB

In [101]:
car_sales.count()

car             9576
price           9576
body            9576
mileage         9576
engV            9142
engType         9576
registration    9576
year            9576
model           9576
drive           9065
dtype: int64

In [102]:
9576 - car_sales.count()

car               0
price             0
body              0
mileage           0
engV            434
engType           0
registration      0
year              0
model             0
drive           511
dtype: int64

In [108]:
car_sales.isnull().sum()

car               0
price             0
body              0
mileage           0
engV            434
engType           0
registration      0
year              0
model             0
drive           511
dtype: int64

In [110]:
car_sales.isnull().sum().sum()

945

In [111]:
people1

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [112]:
people1_df

    Name  Age Blood Group
0  Rocky   60          A+
1    Raj   50          B+
2    Sam   45          B-
3  Vijay   41          O+

In [114]:
people1_df['Score'] = [10,20,30,40]
people1_df

    Name  Age Blood Group  Score
0  Rocky   60          A+     10
1    Raj   50          B+     20
2    Sam   45          B-     30
3  Vijay   41          O+     40

In [115]:
people1_df['Sum']=people1_df['Age']+people1_df['Score']
people1_df

    Name  Age Blood Group  Score  Sum
0  Rocky   60          A+     10   70
1    Raj   50          B+     20   70
2    Sam   45          B-     30   75
3  Vijay   41          O+     40   81

In [117]:
people1_df['Ratio'] = people1_df['Score'] / people1_df['Age'] * 100
people1_df

    Name  Age Blood Group  Score  Sum      Ratio
0  Rocky   60          A+     10   70  16.666667
1    Raj   50          B+     20   70  40.000000
2    Sam   45          B-     30   75  66.666667
3  Vijay   41          O+     40   81  97.560976

In [127]:
people1_df.shape

(4, 6)

In [123]:
people1_df.drop('Sum',axis=1)

    Name  Age Blood Group  Score      Ratio
0  Rocky   60          A+     10  16.666667
1    Raj   50          B+     20  40.000000
2    Sam   45          B-     30  66.666667
3  Vijay   41          O+     40  97.560976

In [124]:
people1_df.drop('Sum',1)

    Name  Age Blood Group  Score      Ratio
0  Rocky   60          A+     10  16.666667
1    Raj   50          B+     20  40.000000
2    Sam   45          B-     30  66.666667
3  Vijay   41          O+     40  97.560976

In [125]:
people1_df

    Name  Age Blood Group  Score  Sum      Ratio
0  Rocky   60          A+     10   70  16.666667
1    Raj   50          B+     20   70  40.000000
2    Sam   45          B-     30   75  66.666667
3  Vijay   41          O+     40   81  97.560976

In [126]:
people1_df.shape

(4, 6)

In [128]:
people1_df.columns

Index(['Name', 'Age', 'Blood Group', 'Score', 'Sum', 'Ratio'], dtype='object')

In [131]:
people1_df.drop('Ratio',axis=1)

    Name  Age Blood Group  Score  Sum
0  Rocky   60          A+     10   70
1    Raj   50          B+     20   70
2    Sam   45          B-     30   75
3  Vijay   41          O+     40   81

In [132]:
people1_df

    Name  Age Blood Group  Score  Sum      Ratio
0  Rocky   60          A+     10   70  16.666667
1    Raj   50          B+     20   70  40.000000
2    Sam   45          B-     30   75  66.666667
3  Vijay   41          O+     40   81  97.560976

In [133]:
people1_df.drop('Ratio',axis=1,inplace=True)

In [134]:
people1_df

    Name  Age Blood Group  Score  Sum
0  Rocky   60          A+     10   70
1    Raj   50          B+     20   70
2    Sam   45          B-     30   75
3  Vijay   41          O+     40   81

In [135]:
people1_df.shape

(4, 5)

In [138]:
people1_df.drop([0,2])

    Name  Age Blood Group  Score  Sum
1    Raj   50          B+     20   70
3  Vijay   41          O+     40   81

In [139]:
people1_df.set_index('Name',inplace = True)

In [140]:
people1_df

       Age Blood Group  Score  Sum
Name
Rocky   60          A+     10   70
Raj     50          B+     20   70
Sam     45          B-     30   75
Vijay   41          O+     40   81

In [141]:
people1_df.shape

(4, 4)

In [145]:
people1_df.drop('Rocky')

       Age Blood Group  Score  Sum
Name
Raj     50          B+     20   70
Sam     45          B-     30   75
Vijay   41          O+     40   81

In [146]:
# Drop any two rows
people1_df.drop(['Rocky','Vijay'])

      Age Blood Group  Score  Sum
Name
Raj    50          B+     20   70
Sam    45          B-     30   75

In [147]:
people1_df

       Age Blood Group  Score  Sum
Name
Rocky   60          A+     10   70
Raj     50          B+     20   70
Sam     45          B-     30   75
Vijay   41          O+     40   81

In [148]:
people1_df.loc['Rocky':'Sam']

       Age Blood Group  Score  Sum
Name
Rocky   60          A+     10   70
Raj     50          B+     20   70
Sam     45          B-     30   75

In [150]:
people1_df.loc[['Rocky','Vijay']]

       Age Blood Group  Score  Sum
Name
Rocky   60          A+     10   70
Vijay   41          O+     40   81

In [155]:
people1_df.loc[:,['Age','Blood Group']]

       Age Blood Group
Name
Rocky   60          A+
Raj     50          B+
Sam     45          B-
Vijay   41          O+

In [157]:
people1_df.loc[:,'Age':'Score']

       Age Blood Group  Score
Name
Rocky   60          A+     10
Raj     50          B+     20
Sam     45          B-     30
Vijay   41          O+     40

In [158]:
people1_df.loc[:,'Age':'Score'].columns

Index(['Age', 'Blood Group', 'Score'], dtype='object')

In [161]:
# drop all columns from Age to Score using loc
people1_df.drop(people1_df.loc[:,'Age':'Score'],1)

       Sum
Name
Rocky   70
Raj     70
Sam     75
Vijay   81

In [164]:
people1_df.iloc[:,0:3]

       Age Blood Group  Score
Name
Rocky   60          A+     10
Raj     50          B+     20
Sam     45          B-     30
Vijay   41          O+     40

In [165]:
# drop all columns from Age to Score using iloc
people1_df.drop(people1_df.iloc[:,0:3],axis=1)

       Sum
Name
Rocky   70
Raj     70
Sam     75
Vijay   81

In [167]:
def double(x):
    num = x
    if num % 6 == 0:
        num*=2
    return num

In [168]:
people1_df['doublescore'] = people1_df['Score'].apply(double)
people1_df

       Age Blood Group  Score  Sum  doublescore
Name
Rocky   60          A+     10   70           10
Raj     50          B+     20   70           20
Sam     45          B-     30   75           60
Vijay   41          O+     40   81           40

In [170]:
people1_df['triplescore'] = people1_df['Score'].apply(lambda x : x*3 if x % 6 ==0 else x)
people1_df

       Age Blood Group  Score  Sum  doublescore  triplescore
Name
Rocky   60          A+     10   70           10           10
Raj     50          B+     20   70           20           20
Sam     45          B-     30   75           60           90
Vijay   41          O+     40   81           40           40

In [171]:
df_csv

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
5,6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [172]:
# Access rows without iloc and loc
df_csv[0:5]

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [175]:
df_csv[0:5,1:]

TypeError: '(slice(0, 5, None), slice(1, None, None))' is an invalid key

In [177]:
df_csv[0:5][0:2]

   ID         Address           City     State Country         Name  Employees
0   1    3666 21st St  San Francisco  CA 94114     USA      Madeira          8
1   2  735 Dolores St  San Francisco  CA 94119     USA  Bready Shop         15

In [176]:
df_csv.iloc[0:5,1:]

,Address,City,State,Country,Name,Employees
0,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
4,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [179]:
# Fetch first 4 rows and all columns
df_csv.iloc[0:4]

df_csv.iloc[0:4,:]

,ID,Address,City,State,Country,Name,Employees
0,1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
1,2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
2,3,332 Hill St,San Francisco,California 94114,USA,Super River,25
3,4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [180]:
# fetch first 4 rows and Second,third and fourth column
df_csv.iloc[:4,1:4]

          Address           City             State
0    3666 21st St  San Francisco          CA 94114
1  735 Dolores St  San Francisco          CA 94119
2     332 Hill St  San Francisco  California 94114
3    3995 23rd St  San Francisco          CA 94114

In [182]:
# fetch all rows and every alternate column start from column 1
df_csv.iloc[:,::2]

   ID           City Country  Employees
0   1  San Francisco     USA          8
1   2  San Francisco     USA         15
2   3  San Francisco     USA         25
3   4  San Francisco     USA         10
4   5  San Francisco     USA         12
5   6  San Francisco     USA         20

In [184]:
df_csv.set_index('ID',inplace=True)

In [185]:
df_csv

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [186]:
df_csv.shape

(6, 6)

In [188]:
# Access first 4 rows through 0:4 and Access first 3 columns through 0:3
df_csv.iloc[:4,:3]

           Address           City             State
ID
1     3666 21st St  San Francisco          CA 94114
2   735 Dolores St  San Francisco          CA 94119
3      332 Hill St  San Francisco  California 94114
4     3995 23rd St  San Francisco          CA 94114

In [189]:
# Access few rows and all columns
df_csv[:3]

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25

In [191]:
# Access All Rows and few columns
df_csv.iloc[:,1:3]

             City             State
ID
1   San Francisco          CA 94114
2   San Francisco          CA 94119
3   San Francisco  California 94114
4   San Francisco          CA 94114
5   San Francisco        California
6   San Francisco          CA 94114

In [192]:
# using loc
# Access 1 to 4 index rows and all columns
df_csv.loc[1:4]

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10

In [194]:
# Access 1 to 4th index rows and Address column
b = df_csv.loc[1:4,'Address']
b

ID
1      3666 21st St
2    735 Dolores St
3       332 Hill St
4      3995 23rd St
Name: Address, dtype: object

In [195]:
type(b)

pandas.core.series.Series

In [198]:
pd.DataFrame(b)

           Address
ID
1     3666 21st St
2   735 Dolores St
3      332 Hill St
4     3995 23rd St

In [199]:
pd.DataFrame(b).reset_index()

   ID         Address
0   1    3666 21st St
1   2  735 Dolores St
2   3     332 Hill St
3   4    3995 23rd St

In [202]:
# Access 1 to 4th index rows and Address and City columns

df_csv.loc[1:4,['Address','City']]

           Address           City
ID
1     3666 21st St  San Francisco
2   735 Dolores St  San Francisco
3      332 Hill St  San Francisco
4     3995 23rd St  San Francisco

In [203]:
# Access 1 to 4th index rows and Address to Name all columns
df_csv.loc[1:4,'Address':'Name']

           Address           City             State Country         Name
ID
1     3666 21st St  San Francisco          CA 94114     USA      Madeira
2   735 Dolores St  San Francisco          CA 94119     USA  Bready Shop
3      332 Hill St  San Francisco  California 94114     USA  Super River
4     3995 23rd St  San Francisco          CA 94114     USA   Ben's Shop

In [205]:
# Access all rows and City to Employees Columns
df_csv.loc[1:4,'City':'Employees']

             City             State Country         Name  Employees
ID
1   San Francisco          CA 94114     USA      Madeira          8
2   San Francisco          CA 94119     USA  Bready Shop         15
3   San Francisco  California 94114     USA  Super River         25
4   San Francisco          CA 94114     USA   Ben's Shop         10

In [206]:
df1 = pd.DataFrame({                                       # Lets create 2 dataframes
    'ID':[1,2,3,4,5],
    'Name':['Amar','Babli','Champak','Danny','Eny'],
    'Sub':['sub1','sub2','sub3','sub4','sub5']
})
df2 = pd.DataFrame({
    'ID':[1,2,3,4,5],
    'Name':['Babli','Champak','Danny','Eny','Farooq'],
    'Sub':['sub3','sub4','sub5','sub6','sub7']
})

In [207]:
print(df1)

print("\n")

print(df2)

   ID     Name   Sub
0   1     Amar  sub1
1   2    Babli  sub2
2   3  Champak  sub3
3   4    Danny  sub4
4   5      Eny  sub5


   ID     Name   Sub
0   1    Babli  sub3
1   2  Champak  sub4
2   3    Danny  sub5
3   4      Eny  sub6
4   5   Farooq  sub7

In [218]:
df3 = pd.concat([df1,df2])

In [219]:
df3

   ID     Name   Sub
0   1     Amar  sub1
1   2    Babli  sub2
2   3  Champak  sub3
3   4    Danny  sub4
4   5      Eny  sub5
0   1    Babli  sub3
1   2  Champak  sub4
2   3    Danny  sub5
3   4      Eny  sub6
4   5   Farooq  sub7

In [213]:
df3.reset_index()

   index  ID     Name   Sub
0      0   1     Amar  sub1
1      1   2    Babli  sub2
2      2   3  Champak  sub3
3      3   4    Danny  sub4
4      4   5      Eny  sub5
5      0   1    Babli  sub3
6      1   2  Champak  sub4
7      2   3    Danny  sub5
8      3   4      Eny  sub6
9      4   5   Farooq  sub7

In [214]:
df3.reset_index().drop('index',axis=1)

   ID     Name   Sub
0   1     Amar  sub1
1   2    Babli  sub2
2   3  Champak  sub3
3   4    Danny  sub4
4   5      Eny  sub5
5   1    Babli  sub3
6   2  Champak  sub4
7   3    Danny  sub5
8   4      Eny  sub6
9   5   Farooq  sub7

In [216]:
df4 = pd.concat([df1,df2],axis=1)

In [220]:
df4

   ID     Name   Sub  ID     Name   Sub
0   1     Amar  sub1   1    Babli  sub3
1   2    Babli  sub2   2  Champak  sub4
2   3  Champak  sub3   3    Danny  sub5
3   4    Danny  sub4   4      Eny  sub6
4   5      Eny  sub5   5   Farooq  sub7

In [221]:
# Lets create 2 dataframes with some different seq in ID, Name, and Sub

df1 = pd.DataFrame({                                 
    'ID':[1,2,3,4,5],
    'Name':['Amar','Babli','Champak','Danny','Eny'],
    'Sub':['sub1','sub2','sub3','sub4','sub5']
})
df2 = pd.DataFrame({
    'ID':[1,2,3,5,4],
    'Name':['Babli','Champak','Danny','Farooq','Eny'],
    'Sub':['sub3','sub4','sub5','sub7','sub6']
})

In [222]:
df5= pd.concat([df1,df2])
df5

   ID     Name   Sub
0   1     Amar  sub1
1   2    Babli  sub2
2   3  Champak  sub3
3   4    Danny  sub4
4   5      Eny  sub5
0   1    Babli  sub3
1   2  Champak  sub4
2   3    Danny  sub5
3   5   Farooq  sub7
4   4      Eny  sub6

In [223]:
df5= pd.concat([df1,df2],axis=1)
df5

   ID     Name   Sub  ID     Name   Sub
0   1     Amar  sub1   1    Babli  sub3
1   2    Babli  sub2   2  Champak  sub4
2   3  Champak  sub3   3    Danny  sub5
3   4    Danny  sub4   5   Farooq  sub7
4   5      Eny  sub5   4      Eny  sub6

In [249]:
# Lets create 2 dataframes with some different seq in ID, Name, and Sub
df1 = pd.DataFrame({                                 
    'ID':[1,2,3,4,6],
    'Name':['Amar','Babli','Champak','Danny','Eny'],
    'Sub':['sub1','sub2','sub3','sub4','sub5']
})
df2 = pd.DataFrame({
    'ID':[1,2,3,5,4],
    'Name':['Babli','Champak','Danny','Farooq','Eny'],
    'Sub':['sub3','sub4','sub5','sub7','sub6']
})

In [250]:
df3 = pd.merge(left=df1, right=df2, on ='ID')
df3

   ID   Name_x Sub_x   Name_y Sub_y
0   1     Amar  sub1    Babli  sub3
1   2    Babli  sub2  Champak  sub4
2   3  Champak  sub3    Danny  sub5
3   4    Danny  sub4      Eny  sub6

In [251]:
df3 = pd.merge(left=df1, right=df2, on ='ID', how = 'inner')
df3

   ID   Name_x Sub_x   Name_y Sub_y
0   1     Amar  sub1    Babli  sub3
1   2    Babli  sub2  Champak  sub4
2   3  Champak  sub3    Danny  sub5
3   4    Danny  sub4      Eny  sub6

In [252]:
df4 = pd.merge(left=df1, right=df2, on ='ID', how = 'left')
df4

   ID   Name_x Sub_x   Name_y Sub_y
0   1     Amar  sub1    Babli  sub3
1   2    Babli  sub2  Champak  sub4
2   3  Champak  sub3    Danny  sub5
3   4    Danny  sub4      Eny  sub6
4   6      Eny  sub5      NaN   NaN

In [253]:
df4 = pd.merge(left=df1, right=df2, on ='ID', how = 'right')
df4

   ID   Name_x Sub_x   Name_y Sub_y
0   1     Amar  sub1    Babli  sub3
1   2    Babli  sub2  Champak  sub4
2   3  Champak  sub3    Danny  sub5
3   5      NaN   NaN   Farooq  sub7
4   4    Danny  sub4      Eny  sub6

In [254]:
df4 = pd.merge(left=df1, right=df2, on ='ID', how = 'outer')
df4

   ID   Name_x Sub_x   Name_y Sub_y
0   1     Amar  sub1    Babli  sub3
1   2    Babli  sub2  Champak  sub4
2   3  Champak  sub3    Danny  sub5
3   4    Danny  sub4      Eny  sub6
4   6      Eny  sub5      NaN   NaN
5   5      NaN   NaN   Farooq  sub7

In [255]:
df4 = pd.merge(left=df1, right=df2, on ='ID', how = 'outer',indicator=True)
df4

   ID   Name_x Sub_x   Name_y Sub_y      _merge
0   1     Amar  sub1    Babli  sub3        both
1   2    Babli  sub2  Champak  sub4        both
2   3  Champak  sub3    Danny  sub5        both
3   4    Danny  sub4      Eny  sub6        both
4   6      Eny  sub5      NaN   NaN   left_only
5   5      NaN   NaN   Farooq  sub7  right_only

In [256]:
df4 = pd.merge(left=df1, right=df2, on ='ID', how = 'outer',indicator=True).query('_merge == "left_only"')
df4

   ID Name_x Sub_x Name_y Sub_y     _merge
4   6    Eny  sub5    NaN   NaN  left_only

In [257]:
df4 = pd.merge(left=df1, right=df2, on ='ID', how = 'outer',indicator=True).query('_merge == "left_only"').drop('_merge',axis=1)
df4

   ID Name_x Sub_x Name_y Sub_y
4   6    Eny  sub5    NaN   NaN

In [ ]:
Examples
--------
>>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [1, 2, 3, 5]})
>>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
...                     'value': [5, 6, 7, 8]})
>>> df1
    lkey value
0   foo      1
1   bar      2
2   baz      3
3   foo      5
>>> df2
    rkey value
0   foo      5
1   bar      6
2   baz      7
3   foo      8

Merge df1 and df2 on the lkey and rkey columns. The value columns have
the default suffixes, _x and _y, appended.

>>> df1.merge(df2, left_on='lkey', right_on='rkey')
  lkey  value_x rkey  value_y

In [231]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})

In [232]:
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],'value': [5, 6, 7, 8]})

In [233]:
df1

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [234]:
df2

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [236]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [237]:
df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=('_left', '_right'))

  lkey  value_left rkey  value_right
0  foo           1  foo            5
1  foo           1  foo            8
2  foo           5  foo            5
3  foo           5  foo            8
4  bar           2  bar            6
5  baz           3  baz            7

In [258]:
df3 = pd.DataFrame({'id':[10],                             # Lets modify our row to a DataFrame
                    'name':['z'], 
                    'sub':['sub10']})
df3

   id name    sub
0  10    z  sub10

In [259]:
df4 = df1
print(df4)
print("\n")
df5 = df3
print(df5)
df6 = df4.append(df3)
df6

   ID     Name   Sub
0   1     Amar  sub1
1   2    Babli  sub2
2   3  Champak  sub3
3   4    Danny  sub4
4   6      Eny  sub5


   id name    sub
0  10    z  sub10

    ID     Name   Sub    id name    sub
0  1.0     Amar  sub1   NaN  NaN    NaN
1  2.0    Babli  sub2   NaN  NaN    NaN
2  3.0  Champak  sub3   NaN  NaN    NaN
3  4.0    Danny  sub4   NaN  NaN    NaN
4  6.0      Eny  sub5   NaN  NaN    NaN
0  NaN      NaN   NaN  10.0    z  sub10

In [260]:
company_data = {
    'Company':['Google','Google','Google','Microsoft','Microsoft','Microsoft'],
    'Year' : [2008,2009,2010,2008,2009,2010],
    'Revenue' : [11,15,16,9,12,14],
    'Employee' : [300,400,500,350,450,550]
}
cmp_df = pd.DataFrame(company_data)
cmp_df

     Company  Year  Revenue  Employee
0     Google  2008       11       300
1     Google  2009       15       400
2     Google  2010       16       500
3  Microsoft  2008        9       350
4  Microsoft  2009       12       450
5  Microsoft  2010       14       550

In [268]:
# Get Microsoft 2009 revenue and employees data
cmp_df[(cmp_df['Company']=='Microsoft') & (cmp_df['Year']==2009)]

     Company  Year  Revenue  Employee
4  Microsoft  2009       12       450

In [271]:
# Create Multiple index.............# Multiple index are used as a list
cmp_df.set_index(['Company','Year'],inplace=True)

In [272]:
cmp_df

                Revenue  Employee
Company   Year
Google    2008       11       300
          2009       15       400
          2010       16       500
Microsoft 2008        9       350
          2009       12       450
          2010       14       550

In [274]:
cmp_df.loc['Microsoft']

      Revenue  Employee
Year
2008        9       350
2009       12       450
2010       14       550

In [275]:
cmp_df.loc['Google']

      Revenue  Employee
Year
2008       11       300
2009       15       400
2010       16       500

In [283]:
cmp_df.loc['Google',2009]

In [284]:
cmp_df.loc['Microsoft',2010]

Revenue      14
Employee    550
Name: (Microsoft, 2010), dtype: int64

In [288]:
cmp_df.loc[['Microsoft','Google'],'Revenue']

Company    Year
Microsoft  2008     9
           2009    12
           2010    14
Google     2008    11
           2009    15
           2010    16
Name: Revenue, dtype: int64

In [304]:
pd.DataFrame(cmp_df.loc[['Google','Microsoft'],'Employee'])

                Employee
Company   Year
Google    2008       300
          2009       400
          2010       500
Microsoft 2008       350
          2009       450
          2010       550

In [305]:
cmp_df.xs('Microsoft',level=0)

      Revenue  Employee
Year
2008        9       350
2009       12       450
2010       14       550

In [306]:
cmp_df.xs('Google',level=0)

      Revenue  Employee
Year
2008       11       300
2009       15       400
2010       16       500

In [307]:
cmp_df.xs(2009,level=1)

           Revenue  Employee
Company
Google          15       400
Microsoft       12       450

In [309]:
cmp_df.xs(2010,level=1)

           Revenue  Employee
Company
Google          16       500
Microsoft       14       550

In [310]:
# Access revene of 2009 of both companies
cmp_df.xs(2009,level=1)['Revenue']

Company
Google       15
Microsoft    12
Name: Revenue, dtype: int64

In [311]:
# Access Employee of 2009 of both companies
cmp_df.xs(2009,level=1)['Employee']

Company
Google       400
Microsoft    450
Name: Employee, dtype: int64

In [317]:
# Access Google revenue of 2009  ..used loc here to access row level data
cmp_df.xs('Google',level=0)

      Revenue  Employee
Year
2008       11       300
2009       15       400
2010       16       500

In [318]:
cmp_df.xs('Google',level=0)['Revenue']

Year
2008    11
2009    15
2010    16
Name: Revenue, dtype: int64

In [320]:
cmp_df.xs('Google',level=0)['Revenue'].loc[2009]

15

In [319]:
cmp_df.xs('Google',level=0).loc[2009,'Revenue']

15

In [323]:
cmp_df.xs(2009,level=1).loc['Google','Revenue']

15

In [325]:
market_df = df_csv
market_df

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [327]:
# Access second and last row and 1st and second last column
market_df.iloc[1::4,::4]

            Address         Name
ID
2    735 Dolores St  Bready Shop
6   551 Alvarado St   Richvalley

In [328]:
# Access employees where count > 15
market_df[market_df['Employees'] > 15]

,Address,City,State,Country,Name,Employees
ID,,,,,,
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [329]:
# Access state CA 94114 entries
market_df[market_df['State'] == 'CA 94114']

            Address           City     State Country        Name  Employees
ID
1      3666 21st St  San Francisco  CA 94114     USA     Madeira          8
4      3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10
6   551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

In [334]:
# Incase of multiple conditions, each condition will be used in seperate pair of brackets ( )
market_df[(market_df['State'] == 'CA 94114') & (market_df['Employees'] >=10)]

            Address           City     State Country        Name  Employees
ID
4      3995 23rd St  San Francisco  CA 94114     USA  Ben's Shop         10
6   551 Alvarado St  San Francisco  CA 94114     USA  Richvalley         20

In [335]:
# Reverse the boolean result with use of not  ~ 
market_df[(market_df['State'] == 'CA 94114') & ~(market_df['Employees'] >=10)]

         Address           City     State Country     Name  Employees
ID
1   3666 21st St  San Francisco  CA 94114     USA  Madeira          8

In [338]:
market_df[~(market_df['State'] == 'CA 94114') & (market_df['Employees'] >=10)]

,Address,City,State,Country,Name,Employees
ID,,,,,,
2,735 Dolores St,San Francisco,CA 94119,USA,Bready Shop,15
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [339]:
# Multiple condition on multiple choices of same column
market_df[(market_df['State'] == 'CA 94114') | (market_df['State']=='CA 94119')]

            Address           City     State Country         Name  Employees
ID
1      3666 21st St  San Francisco  CA 94114     USA      Madeira          8
2    735 Dolores St  San Francisco  CA 94119     USA  Bready Shop         15
4      3995 23rd St  San Francisco  CA 94114     USA   Ben's Shop         10
6   551 Alvarado St  San Francisco  CA 94114     USA   Richvalley         20

In [341]:
# use Series.isin() for accessing multiple elements -----like students info basis roll no's of students.
market_df[market_df['State'].isin(['CA 94114','CA 94119'])]

            Address           City     State Country         Name  Employees
ID
1      3666 21st St  San Francisco  CA 94114     USA      Madeira          8
2    735 Dolores St  San Francisco  CA 94119     USA  Bready Shop         15
4      3995 23rd St  San Francisco  CA 94114     USA   Ben's Shop         10
6   551 Alvarado St  San Francisco  CA 94114     USA   Richvalley         20

In [346]:
# Use of string function
# Access state that contains 'California'
market_df[market_df['State'].str.contains('California')]

,Address,City,State,Country,Name,Employees
ID,,,,,,
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
5,1056 Sanchez St,San Francisco,California,USA,Sanchez,12

In [348]:
# Access state that starts with 'CA'
market_df[market_df['State'].str.startswith('CA')]

            Address           City     State Country         Name  Employees
ID
1      3666 21st St  San Francisco  CA 94114     USA      Madeira          8
2    735 Dolores St  San Francisco  CA 94119     USA  Bready Shop         15
4      3995 23rd St  San Francisco  CA 94114     USA   Ben's Shop         10
6   551 Alvarado St  San Francisco  CA 94114     USA   Richvalley         20

In [350]:
market_df[market_df['Name'].str.endswith('Shop')]

           Address           City     State Country         Name  Employees
ID
2   735 Dolores St  San Francisco  CA 94119     USA  Bready Shop         15
4     3995 23rd St  San Francisco  CA 94114     USA   Ben's Shop         10

In [351]:
market_df[market_df['State'].str.endswith('4')]

,Address,City,State,Country,Name,Employees
ID,,,,,,
1,3666 21st St,San Francisco,CA 94114,USA,Madeira,8
3,332 Hill St,San Francisco,California 94114,USA,Super River,25
4,3995 23rd St,San Francisco,CA 94114,USA,Ben's Shop,10
6,551 Alvarado St,San Francisco,CA 94114,USA,Richvalley,20

In [352]:
market_df['State'].str.upper()

ID
1            CA 94114
2            CA 94119
3    CALIFORNIA 94114
4            CA 94114
5          CALIFORNIA
6            CA 94114
Name: State, dtype: object

In [353]:
market_df['State'].str.lower()

ID
1            ca 94114
2            ca 94119
3    california 94114
4            ca 94114
5          california
6            ca 94114
Name: State, dtype: object

In [354]:
market_df['State'].str.capitalize()

ID
1            Ca 94114
2            Ca 94119
3    California 94114
4            Ca 94114
5          California
6            Ca 94114
Name: State, dtype: object

In [355]:
market_df['State'].str.title()

ID
1            Ca 94114
2            Ca 94119
3    California 94114
4            Ca 94114
5          California
6            Ca 94114
Name: State, dtype: object

In [356]:
cmp_df

                Revenue  Employee
Company   Year
Google    2008       11       300
          2009       15       400
          2010       16       500
Microsoft 2008        9       350
          2009       12       450
          2010       14       550

In [357]:
cmp_df.stack(level=0)

Company    Year
Google     2008  Revenue      11
                 Employee    300
           2009  Revenue      15
                 Employee    400
           2010  Revenue      16
                 Employee    500
Microsoft  2008  Revenue       9
                 Employee    350
           2009  Revenue      12
                 Employee    450
           2010  Revenue      14
                 Employee    550
dtype: int64

In [361]:
cmp_df.unstack(level=1)

          Revenue           Employee
Year         2008 2009 2010     2008 2009 2010
Company
Google         11   15   16      300  400  500
Microsoft       9   12   14      350  450  550

In [364]:
cmp_df

                Revenue  Employee
Company   Year
Google    2008       11       300
          2009       15       400
          2010       16       500
Microsoft 2008        9       350
          2009       12       450
          2010       14       550

In [374]:
cmp_df.unstack(level=-2)

        Revenue           Employee
Company  Google Microsoft   Google Microsoft
Year
2008         11         9      300       350
2009         15        12      400       450
2010         16        14      500       550

In [377]:
import seaborn as sns

tips = sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [378]:
tips.shape

(244, 7)

In [379]:
tips.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
dtypes: category(4), float64(2), int64(1)
memory usage: 7.3 KB

In [380]:
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [381]:
tips.describe(include='all')

        total_bill         tip   sex smoker  day    time        size
count   244.000000  244.000000   244    244  244     244  244.000000
unique         NaN         NaN     2      2    4       2         NaN
top            NaN         NaN  Male     No  Sat  Dinner         NaN
freq           NaN         NaN   157    151   87     176         NaN
mean     19.785943    2.998279   NaN    NaN  NaN     NaN    2.569672
std       8.902412    1.383638   NaN    NaN  NaN     NaN    0.951100
min       3.070000    1.000000   NaN    NaN  NaN     NaN    1.000000
25%      13.347500    2.000000   NaN    NaN  NaN     NaN    2.000000
50%      17.795000    2.900000   NaN    NaN  NaN     NaN    2.000000
75%      24.127500    3.562500   NaN    NaN  NaN     NaN    3.000000
max      50.810000   10.000000   NaN    NaN  NaN     NaN    6.000000

In [382]:
tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [383]:
# unique command is very useful for categorical columns
tips['sex'].unique()

['Female', 'Male']
Categories (2, object): ['Female', 'Male']

In [384]:
tips['day'].unique()

['Sun', 'Sat', 'Thur', 'Fri']
Categories (4, object): ['Sun', 'Sat', 'Thur', 'Fri']

In [385]:
tips['time'].unique()

['Dinner', 'Lunch']
Categories (2, object): ['Dinner', 'Lunch']

In [386]:
tips['size'].unique()

array([2, 3, 4, 1, 6, 5], dtype=int64)

In [387]:
tips['smoker'].unique()

['No', 'Yes']
Categories (2, object): ['No', 'Yes']

In [388]:
tips['total_bill'].unique()

array([16.99, 10.34, 21.01, 23.68, 24.59, 25.29,  8.77, 26.88, 15.04,
       14.78, 10.27, 35.26, 15.42, 18.43, 14.83, 21.58, 10.33, 16.29,
       16.97, 20.65, 17.92, 20.29, 15.77, 39.42, 19.82, 17.81, 13.37,
       12.69, 21.7 , 19.65,  9.55, 18.35, 15.06, 20.69, 17.78, 24.06,
       16.31, 16.93, 18.69, 31.27, 16.04, 17.46, 13.94,  9.68, 30.4 ,
       18.29, 22.23, 32.4 , 28.55, 18.04, 12.54, 10.29, 34.81,  9.94,
       25.56, 19.49, 38.01, 26.41, 11.24, 48.27, 13.81, 11.02, 17.59,
       20.08, 16.45,  3.07, 20.23, 15.01, 12.02, 17.07, 26.86, 25.28,
       14.73, 10.51, 27.2 , 22.76, 17.29, 19.44, 16.66, 10.07, 32.68,
       15.98, 34.83, 13.03, 18.28, 24.71, 21.16, 28.97, 22.49,  5.75,
       16.32, 22.75, 40.17, 27.28, 12.03, 12.46, 11.35, 15.38, 44.3 ,
       22.42, 20.92, 15.36, 20.49, 25.21, 18.24, 14.31, 14.  ,  7.25,
       38.07, 23.95, 25.71, 17.31, 29.93, 10.65, 12.43, 24.08, 11.69,
       13.42, 14.26, 15.95, 12.48, 29.8 ,  8.52, 14.52, 11.38, 22.82,
       19.08, 20.27, 11.17, 12.26, 18.26,  8.51, 14.15, 16.  , 13.16,
       17.47, 34.3 , 41.19, 27.05, 16.43,  8.35, 18.64, 11.87,  9.78,
        7.51, 14.07, 13.13, 17.26, 24.55, 19.77, 29.85, 48.17, 25.  ,
       13.39, 16.49, 21.5 , 12.66, 16.21, 17.51, 24.52, 20.76, 31.71,
       10.59, 10.63, 50.81, 15.81, 31.85, 16.82, 32.9 , 17.89, 14.48,
        9.6 , 34.63, 34.65, 23.33, 45.35, 23.17, 40.55, 20.9 , 30.46,
       18.15, 23.1 , 15.69, 19.81, 28.44, 15.48, 16.58,  7.56, 43.11,
       13.  , 13.51, 18.71, 12.74, 16.4 , 20.53, 16.47, 26.59, 38.73,
       24.27, 12.76, 30.06, 25.89, 48.33, 13.27, 28.17, 12.9 , 28.15,
       11.59,  7.74, 30.14, 12.16,  8.58, 16.27, 10.09, 20.45, 13.28,
       22.12, 24.01, 11.61, 10.77, 15.53, 12.6 , 32.83, 35.83, 29.03,
       27.18, 22.67, 17.82, 18.78])

In [389]:
tips['tip'].unique()

array([ 1.01,  1.66,  3.5 ,  3.31,  3.61,  4.71,  2.  ,  3.12,  1.96,
        3.23,  1.71,  5.  ,  1.57,  3.  ,  3.02,  3.92,  1.67,  3.71,
        3.35,  4.08,  2.75,  2.23,  7.58,  3.18,  2.34,  4.3 ,  1.45,
        2.5 ,  2.45,  3.27,  3.6 ,  3.07,  2.31,  2.24,  2.54,  3.06,
        1.32,  5.6 ,  6.  ,  2.05,  2.6 ,  5.2 ,  1.56,  4.34,  3.51,
        1.5 ,  1.76,  6.73,  3.21,  1.98,  3.76,  2.64,  3.15,  2.47,
        1.  ,  2.01,  2.09,  1.97,  3.14,  2.2 ,  1.25,  3.08,  4.  ,
        2.71,  3.4 ,  1.83,  2.03,  5.17,  5.85,  3.25,  4.73,  3.48,
        1.64,  4.06,  4.29,  2.55,  5.07,  1.8 ,  2.92,  1.68,  2.52,
        4.2 ,  1.48,  2.18,  2.83,  6.7 ,  2.3 ,  1.36,  1.63,  1.73,
        2.74,  5.14,  3.75,  2.61,  4.5 ,  1.61, 10.  ,  3.16,  5.15,
        3.11,  3.55,  3.68,  5.65,  6.5 ,  4.19,  2.56,  2.02,  1.44,
        3.41,  5.16,  9.  ,  1.1 ,  3.09,  1.92,  1.58,  2.72,  2.88,
        3.39,  1.47,  1.17,  4.67,  5.92,  1.75])

In [390]:
tips['tip'].mean()

2.9982786885245902

In [391]:
tips['total_bill'].mean()

19.785942622950824

In [394]:
# Check is country people are good tipper ?
tips['tip'].mean()/tips['total_bill'].mean() * 100

15.153580224410025

In [395]:

tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [397]:
# Check Average tip during Lunch time
tips[tips['time']=='Lunch']['tip'].mean()

2.7280882352941176

In [399]:
# Check Average tip during Dinner time
tips[tips['time']=='Dinner']['tip'].mean()

3.102670454545454

In [401]:
# How people are good or bad with Lunch or Dinner tips
tips[tips['time']=='Lunch']['tip'].mean() / tips[tips['time']=='Dinner']['tip'].mean() * 100

87.9271026446728

In [402]:
tips[tips['time']=='Dinner']['tip'].mean() * 100 / tips[tips['time']=='Lunch']['tip'].mean()

113.73057566119932

In [406]:
tips['time'].value_counts()

Dinner    176
Lunch      68
Name: time, dtype: int64

In [410]:
tips[tips['time']=='Lunch'].count()['time']

68

In [411]:
# Calculate standard deviation
tips.std()

total_bill    8.902412
tip           1.383638
size          0.951100
dtype: float64

In [413]:
tips['tip'].std()

1.3836381890011826

In [414]:
# Who do you think tip more, people who come in group or people who come alone
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [421]:
tips['size'].unique()

array([2, 3, 4, 1, 6, 5], dtype=int64)

In [423]:
tips[tips['size']==1]['tip'].mean()

1.4375

In [424]:
tips[tips['size']> 1]['tip'].mean()

3.024291666666667

In [426]:
tips[tips['size']==1]['tip'].mean() / tips[tips['size'] > 1]['tip'].mean() * 100

47.53179119077469

In [427]:
tips['tip_percent'] = tips['tip'] / tips['total_bill']

In [428]:
tips

     total_bill   tip     sex smoker   day    time  size  tip_percent
0         16.99  1.01  Female     No   Sun  Dinner     2     0.059447
1         10.34  1.66    Male     No   Sun  Dinner     3     0.160542
2         21.01  3.50    Male     No   Sun  Dinner     3     0.166587
3         23.68  3.31    Male     No   Sun  Dinner     2     0.139780
4         24.59  3.61  Female     No   Sun  Dinner     4     0.146808
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3     0.203927
240       27.18  2.00  Female    Yes   Sat  Dinner     2     0.073584
241       22.67  2.00    Male    Yes   Sat  Dinner     2     0.088222
242       17.82  1.75    Male     No   Sat  Dinner     2     0.098204
243       18.78  3.00  Female     No  Thur  Dinner     2     0.159744

[244 rows x 8 columns]

In [429]:
tips[tips['size']==1]['tip_percent'].mean()

0.2172920154872781

In [430]:
tips[tips['size']> 1]['tip_percent'].mean()

0.15986109115975852

In [432]:
tips[tips['size']==1]['tip_percent'].mean() / tips[tips['size']> 1]['tip_percent'].mean() * 100

135.92551752954415

In [434]:
# Who tip more Male or Female ?
tips[tips['sex']=='Male']['tip_percent'].mean()

0.15765054700429748

In [435]:
tips[tips['sex']=='Female']['tip_percent'].mean()

0.16649073632892475

In [436]:
tips[tips['sex']=='Female']['tip_percent'].mean() / tips[tips['sex']=='Male']['tip_percent'].mean()

1.0560745870700106

In [444]:
#% of female tippers in total tippers

tips[tips['sex']=='Female']['sex'].count() / tips['sex'].count() * 100

35.65573770491803

In [445]:
# Who tip more smoker or non-smoker ?
tips[tips['smoker']=='Yes']['tip_percent'].mean()

0.1631960446368779

In [446]:
tips[tips['smoker']=='No']['tip_percent'].mean()

0.1593284621792153

In [452]:
tips[tips['smoker']=='Yes']['tip_percent'].mean()/ tips[tips['smoker']=='No']['tip_percent'].mean() * 100

102.42742721844151

In [453]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_percent
0       16.99  1.01  Female     No  Sun  Dinner     2     0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3     0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3     0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2     0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4     0.146808

In [454]:
tips.groupby('time').mean()

        total_bill       tip      size  tip_percent
time
Lunch    17.168676  2.728088  2.411765     0.164128
Dinner   20.797159  3.102670  2.630682     0.159518

In [455]:
tips.groupby('time')['tip'].mean()

time
Lunch     2.728088
Dinner    3.102670
Name: tip, dtype: float64

In [456]:
tips.groupby('time')['tip_percent'].mean()

time
Lunch     0.164128
Dinner    0.159518
Name: tip_percent, dtype: float64

In [457]:
tips.groupby('smoker')['tip_percent'].mean()

smoker
Yes    0.163196
No     0.159328
Name: tip_percent, dtype: float64

In [460]:
tips.groupby('smoker').count()

        total_bill  tip  sex  day  time  size  tip_percent
smoker
Yes             93   93   93   93    93    93           93
No             151  151  151  151   151   151          151

In [462]:
# Who is more generous smoker or non-smoker ?
bysmoker = tips.groupby('smoker')
bysmoker.mean()

        total_bill       tip      size  tip_percent
smoker
Yes      20.756344  3.008710  2.408602     0.163196
No       19.188278  2.991854  2.668874     0.159328

In [463]:
tips.groupby('sex').sum()

        total_bill     tip  size  tip_percent
sex
Male       3256.82  485.07   413    24.751136
Female     1570.95  246.51   214    14.484694

In [465]:
tips.groupby(['day','time']).count()

             total_bill   tip   sex  smoker  size  tip_percent
day  time
Thur Lunch         61.0  61.0  61.0    61.0  61.0         61.0
     Dinner         1.0   1.0   1.0     1.0   1.0          1.0
Fri  Lunch          7.0   7.0   7.0     7.0   7.0          7.0
     Dinner        12.0  12.0  12.0    12.0  12.0         12.0
Sat  Lunch          NaN   NaN   NaN     NaN   NaN          NaN
     Dinner        87.0  87.0  87.0    87.0  87.0         87.0
Sun  Lunch          NaN   NaN   NaN     NaN   NaN          NaN
     Dinner        76.0  76.0  76.0    76.0  76.0         76.0

In [481]:
#At which day, When maximum dinner Served ?
tips[tips['time']=='Dinner'].groupby(['day'])['time'].count()

day
Thur     1
Fri     12
Sat     87
Sun     76
Name: time, dtype: int64

In [487]:
# Which is the most busy day ?
tips.groupby('day')['size'].mean()

day
Thur    2.451613
Fri     2.105263
Sat     2.517241
Sun     2.842105
Name: size, dtype: float64

In [489]:
# days serve %
tips.groupby('day')['total_bill'].count() / tips['day'].count()

day
Thur    0.254098
Fri     0.077869
Sat     0.356557
Sun     0.311475
Name: total_bill, dtype: float64

In [490]:
# At which day tip is more ? 

tips.groupby('day')['tip_percent'].mean()

day
Thur    0.161276
Fri     0.169913
Sat     0.153152
Sun     0.166897
Name: tip_percent, dtype: float64

In [495]:
tips.groupby('day')[['total_bill','tip']].sum()

      total_bill     tip
day
Thur     1096.33  171.83
Fri       325.88   51.96
Sat      1778.40  260.40
Sun      1627.16  247.39

In [496]:
# At which time of the day tip is more ?

tips.groupby('time')['tip_percent'].mean()

time
Lunch     0.164128
Dinner    0.159518
Name: tip_percent, dtype: float64

In [497]:
tips.head()

   total_bill   tip     sex smoker  day    time  size  tip_percent
0       16.99  1.01  Female     No  Sun  Dinner     2     0.059447
1       10.34  1.66    Male     No  Sun  Dinner     3     0.160542
2       21.01  3.50    Male     No  Sun  Dinner     3     0.166587
3       23.68  3.31    Male     No  Sun  Dinner     2     0.139780
4       24.59  3.61  Female     No  Sun  Dinner     4     0.146808

In [498]:
# Do females eat more on specific day    ---# when they eat more

tips.groupby(['sex','day'])['total_bill'].mean()

sex     day
Male    Thur    18.714667
        Fri     19.857000
        Sat     20.802542
        Sun     21.887241
Female  Thur    16.715312
        Fri     14.145556
        Sat     19.680357
        Sun     19.872222
Name: total_bill, dtype: float64

In [500]:
byfemaleday =tips[tips['sex']=='Female'].groupby('day').mean()
byfemaleday

      total_bill       tip      size  tip_percent
day
Thur   16.715312  2.575625  2.468750     0.157525
Fri    14.145556  2.781111  2.111111     0.199388
Sat    19.680357  2.801786  2.250000     0.156470
Sun    19.872222  3.367222  2.944444     0.181569

In [501]:
byfemaleday['billedbysize'] = byfemaleday['total_bill'] / byfemaleday['size']
byfemaleday

      total_bill       tip      size  tip_percent  billedbysize
day
Thur   16.715312  2.575625  2.468750     0.157525      6.770759
Fri    14.145556  2.781111  2.111111     0.199388      6.700526
Sat    19.680357  2.801786  2.250000     0.156470      8.746825
Sun    19.872222  3.367222  2.944444     0.181569      6.749057

In [503]:
bydayandgender = pd.DataFrame(tips.groupby(['day','sex'])['total_bill'].sum())
bydayandgender

             total_bill
day  sex
Thur Male        561.44
     Female      534.89
Fri  Male        198.57
     Female      127.31
Sat  Male       1227.35
     Female      551.05
Sun  Male       1269.46
     Female      357.70

In [504]:
bydayandgender.unstack(level=1)

     total_bill
sex        Male  Female
day
Thur     561.44  534.89
Fri      198.57  127.31
Sat     1227.35  551.05
Sun     1269.46  357.70

In [505]:
bydayandgender.unstack(level=0)

       total_bill
day          Thur     Fri      Sat      Sun
sex
Male       561.44  198.57  1227.35  1269.46
Female     534.89  127.31   551.05   357.70